app/Controllers/CRUD.php

    public function Vista_CRUD(){
        $UsuarioModel = new UsuarioModel();
        $data['usuario'] = $UsuarioModel->orderBy('id_usuarios')->findAll();
---
SELECT *
FROM `usuarios`
ORDER BY `id_usuarios`

    public function delete($id_usuarios = null){
        $UsuarioModel = new UsuarioModel();
        $data['usuario'] = $UsuarioModel->where('id_usuarios', $id_usuarios)->delete();
---
DELETE FROM `usuarios`
WHERE `id_usuarios` = '4'

    public function singleUser($id_usuarios = null) {
        $UsuarioModel = new UsuarioModel();
        $data['user_obj'] = $UsuarioModel->where('id_usuarios', $id_usuarios)->first();
---
SELECT *
FROM `usuarios`
WHERE `id_usuarios` = '1'
 LIMIT 1

public function store()
{
    $UsuarioModel = new UsuarioModel();

    // Obtener la contraseña sin encriptar
    $password = $this->request->getVar('password');

    // Encriptar la contraseña
    $contrasenaEncriptada = password_hash($password, PASSWORD_DEFAULT);

    $data = [
        'nombre' => $this->request->getVar('nombre'),
        'apellido' => $this->request->getVar('apellido'),
        'cedula' => $this->request->getVar('cedula'),
        'usuario' => $this->request->getVar('usuario'),
        'telefono' => $this->request->getVar('telefono'),
        'password' => $contrasenaEncriptada, // Guardar la contraseña encriptada en la base de datos
    ];

    $UsuarioModel->insert($data);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `cedula`, `usuario`, `telefono`, `password`) VALUES ('janeth', 'ovalles', '12312312', '12312312beti', '04241231212', '$2y$10$r.whfpDtEOqFZUyid69EeOvDZdDk3krvIO5zcNLUKnLEXtMA1xaAy')