app/Controllers/Perfil.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuarios` = '1'
SELECT *
FROM `publicaciones`
WHERE `id_usuarios` = '1'
---
    public function account()
    {
        // Obtener los datos del usuario a partir de la sesión
        $usuarioId = session('usuario')['id_usuarios'];
        $usuario = session('usuario')['usuario'];
        $nombre = session('usuario')['nombre'];
        $apellido = session('usuario')['apellido'];
        $telefono = session('usuario')['telefono'];
        $biografia = session('usuario')['biografia'];

        // Obtener el rol del usuario desde la base de datos
        $UsuarioModel = new UsuarioModel();
        $usuarioData = $UsuarioModel->find($usuarioId);
        $roles = $usuarioData['roles'];

        // Obtener la URL del avatar del usuario
        $avatarModel = new AvatarModel();
        $avatar = $avatarModel->where('id_perfiles', $usuarioId)->first();
        $avatarSrc = $avatar ? $avatar['avatar_url'] : 'ruta_predeterminada_del_avatar';

            // Obtener las publicaciones del usuario
        $publicacionesModel = new PublicacionesModel();
        $publicaciones = $publicacionesModel->where('id_usuarios', $usuarioId)->findAll();