app/Controllers/Publicar.php

    public function Principal($categoriaId = null)
{
    $publicacionesModel = new PublicacionesModel();

    if ($categoriaId !== null) {
        $publicaciones = $publicacionesModel->where('id_categorias', $categoriaId)->findAll();
    } else {
        $publicaciones = $publicacionesModel->findAll();
---
SELECT *
FROM `publicaciones`